# .value_counts method

In [9]:
import pandas as pd

pokemon = pd.read_csv("pokemon.csv",squeeze = True, usecols = ["Name"])
pokemon.head()

0                Bulbasaur
1                  Ivysaur
2                 Venusaur
3    VenusaurMega Venusaur
4               Charmander
Name: Name, dtype: object

In [10]:
pokemon.value_counts()

Snubbull               1
Roselia                1
Purrloin               1
Noibat                 1
Pidgeotto              1
                      ..
WormadamPlant Cloak    1
Phanpy                 1
Blitzle                1
Zebstrika              1
Bronzong               1
Name: Name, Length: 800, dtype: int64

In [12]:
pokemon.value_counts().sum()

800

In [13]:
pokemon.count()

800

# .apply() method

In [24]:
import pandas as pd

google = pd.read_csv("google_stock_price.csv", squeeze = True)
google.head()

0    50.12
1    54.10
2    54.65
3    52.38
4    52.95
Name: Stock Price, dtype: float64

In [21]:
def case(Stock Price):
    if Stock Price < 300:
        return "ok"
    elif Stock Price >= 300 and Stock Price < 650:
        return "satisfy"
    else:
        return "inredible"

In [26]:
google.apply(case).head(11)

0     ok
1     ok
2     ok
3     ok
4     ok
5     ok
6     ok
7     ok
8     ok
9     ok
10    ok
Name: Stock Price, dtype: object

In [27]:
google.apply(case).tail(11)

3001    inredible
3002    inredible
3003    inredible
3004    inredible
3005    inredible
3006    inredible
3007    inredible
3008    inredible
3009    inredible
3010    inredible
3011    inredible
Name: Stock Price, dtype: object

In [38]:
google.apply(lambda stock_price : stock_price + 1).head()

0    51.12
1    55.10
2    55.65
3    53.38
4    53.95
Name: Stock Price, dtype: float64

# Dataframes

In [41]:
import pandas as pd
nba = pd.read_csv("nba.csv")
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [42]:
nba.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [43]:
nba.index

RangeIndex(start=0, stop=458, step=1)

In [44]:
nba.shape

(458, 9)

In [45]:
nba.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [46]:
nba.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [47]:
nba.axes

[RangeIndex(start=0, stop=458, step=1),
 Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
        'College', 'Salary'],
       dtype='object')]

In [48]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [53]:
nba.count()

Name        457
Team        457
Number      457
Position    457
Age         457
Height      457
Weight      457
College     373
Salary      446
dtype: int64

# Shared Method & Column access

In [60]:
import pandas as pd
rev = pd.read_csv("revenue.csv", index_col = "Date")
rev.head()

       Salesman  Revenue
Date
1/1/16      Bob     7172
1/2/16      Bob     6362
1/3/16      Bob     5982
1/4/16      Bob     7917
1/5/16      Bob     7837

In [58]:
s = pd.Series([1,2,3])
s.sum()

6

In [61]:
rev.sum()

Salesman    BobBobBobBobBobBobBobBobBobBobBobBobBobBobBobB...
Revenue                                               9209551
dtype: object

In [62]:
rev.sum(axis = 0) # for columns

Salesman    BobBobBobBobBobBobBobBobBobBobBobBobBobBobBobB...
Revenue                                               9209551
dtype: object

In [64]:
rev.sum(axis = "index")

Salesman    BobBobBobBobBobBobBobBobBobBobBobBobBobBobBobB...
Revenue                                               9209551
dtype: object

In [63]:
rev.sum(axis = 1) # for rows

Date
1/1/16      7172
1/2/16      6362
1/3/16      5982
1/4/16      7917
1/5/16      7837
            ...
12/27/16     835
12/28/16    3073
12/29/16    6424
12/30/16    7088
12/31/16    8408
Length: 1830, dtype: int64

In [65]:
rev.sum("columns")

Date
1/1/16      7172
1/2/16      6362
1/3/16      5982
1/4/16      7917
1/5/16      7837
            ...
12/27/16     835
12/28/16    3073
12/29/16    6424
12/30/16    7088
12/31/16    8408
Length: 1830, dtype: int64

In [68]:
nba = pd.read_csv("nba.csv")
nba.head(11)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0
10,Jared Sullinger,Boston Celtics,7.0,C,24.0,6-9,260.0,Ohio State,2569260.0

In [69]:
nba.Name.head()

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [70]:
type(nba.Name)

pandas.core.series.Series

In [73]:
nba["Name"].head() # 100% accurate

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [74]:
nba[["Team","Name"]].head()

             Team           Name
0  Boston Celtics  Avery Bradley
1  Boston Celtics    Jae Crowder
2  Boston Celtics   John Holland
3  Boston Celtics    R.J. Hunter
4  Boston Celtics  Jonas Jerebko

In [76]:
sel = ["Team","Name"]
nba[sel].head()

             Team           Name
0  Boston Celtics  Avery Bradley
1  Boston Celtics    Jae Crowder
2  Boston Celtics   John Holland
3  Boston Celtics    R.J. Hunter
4  Boston Celtics  Jonas Jerebko

# Add column in DataFrame

In [78]:
import pandas as pd
nba = pd.read_csv("nba.csv")
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [79]:
nba["Name"]

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, Length: 458, dtype: object

In [86]:
nba["Sports"] = "BasketBall"
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Sports
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,BasketBall
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,BasketBall
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,BasketBall
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,BasketBall
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,BasketBall

# or

In [100]:
nba.insert(3, column = "games", value = "basketball2")

In [98]:
nba.head()

,Name,Team,Number,games,game,sports2,Position,Age,Height,Weight,College,Salary,Sports
0,Avery Bradley,Boston Celtics,0.0,basketball2,basketball2,basketball2,PG,25.0,6-2,180.0,Texas,7730337.0,BasketBall
1,Jae Crowder,Boston Celtics,99.0,basketball2,basketball2,basketball2,SF,25.0,6-6,235.0,Marquette,6796117.0,BasketBall
2,John Holland,Boston Celtics,30.0,basketball2,basketball2,basketball2,SG,27.0,6-5,205.0,Boston University,NaN,BasketBall
3,R.J. Hunter,Boston Celtics,28.0,basketball2,basketball2,basketball2,SG,22.0,6-5,185.0,Georgia State,1148640.0,BasketBall
4,Jonas Jerebko,Boston Celtics,8.0,basketball2,basketball2,basketball2,PF,29.0,6-10,231.0,NaN,5000000.0,BasketBall